"""
Функция polynom()
Реализуйте функцию polynom(), которая принимает один аргумент:
x — целое число
Функция должна возвращать значение выражения x2+1.

Также функция должна иметь атрибут values, представляющий собой множество
    (тип set) всех значений функции, которые уже были вычислены.
"""


def polynom(x):
    pass


print(polynom(5))
print(polynom.values)
"""
26
{26}
"""
