"""
Функция remove_marks()
Реализуйте функцию remove_marks(), которая принимает два аргумента в следующем порядке:
text — произвольная строка
marks — набор символов
Функция должна возвращать строку text, предварительно удалив из нее все символы, перечисленные в строке marks.
Также функция remove_marks() должна иметь атрибут count, представляющий собой количество вызовов данной функции.
"""


def remove_marks(text, marks):
    pass


text = "Hi! Will we go together?"

print(remove_marks(text, "!?"))
print(remove_marks.count)

"""
Hi Will we go together
1
"""
