"""
Коллекции
Напишите программу, которая принимает на вход корректный непустой список,
    корректный непустой кортеж или корректное множество произвольной длины, и выполняет следующее:
если введен список, выводит его последний элемент
если введен кортеж, выводит его первый элемент
если введено множество, выводит количество его элементов
"""

d = [[1, 2], [3, 4], [5, 6]]
# [5, 6]
d = {"Arthur", "Timur", "Anri", "Ruslan", "Dima"}
# 5
d = ("black", "blue", "red", "orange", "green", "gray")
# black
