"""
Реализуйте функцию verification(), которая проверяет правильность введенного пароля.
Она должна принимать четыре аргумента в следующем порядке:
    login — логин пользователя
    password — пароль пользователя
    success — некоторая функция
    failure — некоторая функция
Пароль считается правильным, если в нем присутствует, хотя бы одна заглавная латинская буква, хотя бы одна
строчная латинская буква и хотя бы одна цифра. Функция verification() должна вызывать функцию success() с аргументом login,
если переданный пароль является правильным, иначе — функцию failure() с аргументами login и строкой-сообщением об ошибке:
    в пароле нет ни одной буквы, если в пароле отсутствуют латинские буквы
    в пароле нет ни одной заглавной буквы, если в пароле отсутствуют заглавные латинские буквы
    в пароле нет ни одной строчной буквы, если в пароле отсутствуют строчные латинские буквы
    в пароле нет ни одной цифры, если в пароле отсутствуют цифры
"""


def success(login):
    print(f"Привет, {login}!")


def failure(login, text):
    print(f"{login}, попробуйте снова. Ошибка: {text}")


def verification():
    pass


verification("timyrik20", "Beegeek314", success, failure)

# Привет, timyrik20!
