"""
Строчный алфавит
Напишите программу, которая выводит все строчные латинские буквы.
"""

for i in range(ord("a"), ord("z") + 1):
    print(chr(i))
