"""
Функция convert()
Реализуйте функцию convert(), которая принимает один аргумент:
number — целое число
Функция должна возвращать кортеж из трех элементов, расположенных в следующем порядке:
двоичное представление числа number в виде строки без префикса 0b
восьмеричное представление числа number в виде строки без префикса 0o
шестнадцатеричное представление числа number в виде строки в верхнем регистре без префикса 0x
"""


def convert():
    pass


print(convert(15))
# ('1111', '17', 'F')
print(convert(-24))
# ('-11000', '-30', '-18')
print(convert(1))
# ('1', '1', '1')
